Repository: andrekirst/family2
Catalog: src/FamilyHub.Api/Resources/DomainErrors.*.resx
Languages: de

# USER_ALREADY_ASSIGNED_TO_FAMILY
source: User is already assigned to a family
de: Benutzer ist bereits einer Familie zugeordnet

# USER_NOT_ASSIGNED_TO_FAMILY
source: User is not assigned to any family
de: Benutzer ist keiner Familie zugeordnet

source: User not found
de: Benutzer nicht gefunden

# USER_ALREADY_EXISTS
source: A user with this email already exists
de: Ein Benutzer mit dieser E-Mail-Adresse existiert bereits

# USER_ALREADY_OWNS_FAMILY
source: User already owns a family
de: Benutzer besitzt bereits eine Familie

source: Family creation failed
de: Familienerstellung fehlgeschlagen

source: Invitation not found
de: Einladung nicht gefunden

# INVITATION_EXPIRED
source: Invitation has expired
de: Einladung ist abgelaufen

# INVITATION_INVALID_STATUS_FOR_ACCEPT
source: Cannot accept invitation in its current status
de: Einladung kann im aktuellen Status nicht angenommen werden

# INVITATION_INVALID_STATUS_FOR_DECLINE
source: Cannot decline invitation in its current status
de: Einladung kann im aktuellen Status nicht abgelehnt werden

# INVITATION_INVALID_STATUS_FOR_REVOKE
source: Cannot revoke invitation in its current status
de: Einladung kann im aktuellen Status nicht widerrufen werden

source: Invalid invitation token
de: Ungültiger Einladungstoken

# INVITATION_EMAIL_MISMATCH
source: This invitation was sent to a different email address
de: Diese Einladung wurde an eine andere E-Mail-Adresse gesendet

# ALREADY_FAMILY_MEMBER
source: You are already a member of this family
de: Du bist bereits Mitglied dieser Familie

# INSUFFICIENT_PERMISSION_TO_SEND_INVITATION
source: You do not have permission to send invitations for this family
de: Du hast keine Berechtigung, Einladungen für diese Familie zu senden

# INSUFFICIENT_PERMISSION_TO_REVOKE_INVITATION
source: You do not have permission to revoke invitations for this family
de: Du hast keine Berechtigung, Einladungen für diese Familie zu widerrufen

# DUPLICATE_INVITATION
source: An invitation has already been sent to this email for this family
de: An diese E-Mail-Adresse wurde bereits eine Einladung für diese Familie gesendet

# MUST_BE_FAMILY_MEMBER_TO_SEND_INVITATION
source: You must be part of a family to send invitations
de: Du musst Mitglied einer Familie sein, um Einladungen zu senden

source: Calendar event not found
de: Kalenderereignis nicht gefunden

# EVENT_ALREADY_CANCELLED
source: Event is already cancelled
de: Ereignis ist bereits abgesagt

# CANNOT_UPDATE_CANCELLED_EVENT
source: Cannot update a cancelled event
de: Ein abgesagtes Ereignis kann nicht aktualisiert werden

# MUST_BE_FAMILY_MEMBER_TO_CREATE_EVENT
source: User must belong to a family to create events
de: Benutzer muss einer Familie angehören, um Ereignisse zu erstellen

source: Chain definition not found
de: Kettendefinition nicht gefunden

source: Chain execution not found
de: Kettenausführung nicht gefunden

# DUPLICATE_STEP_ALIAS
source: Step alias already exists in this chain
de: Schritt-Alias existiert bereits in dieser Kette

source: Unknown trigger event type
de: Unbekannter Auslöser-Ereignistyp

source: Unknown action type
de: Unbekannter Aktionstyp

# USER_NOT_IN_FAMILY
source: User is not assigned to a family
de: Benutzer ist keiner Familie zugeordnet
