Repository: andrekirst/family2
Catalog: src/FamilyHub.Api/Resources/ValidationMessages.*.resx
Languages: de

# EmailRequired
source: Email is required
de: E-Mail ist erforderlich

# NameRequired
source: Name is required
de: Name ist erforderlich

# ExternalUserIdRequired
source: External user ID is required
de: Externe Benutzer-ID ist erforderlich

# UsernameMinLength
source: Username must be at least 3 characters
de: Benutzername muss mindestens 3 Zeichen lang sein

# UsernameMaxLength
source: Username cannot exceed 50 characters
de: Benutzername darf 50 Zeichen nicht überschreiten

# UsernameInvalidFormat
source: Username can only contain letters, numbers, underscores, and hyphens
de: Benutzername darf nur Buchstaben, Zahlen, Unterstriche und Bindestriche enthalten

# LoginTimeCannotBeFuture
source: Login time cannot be in the future
de: Anmeldezeit darf nicht in der Zukunft liegen

# EventTitleRequired
source: Event title is required
de: Ereignistitel ist erforderlich

# FamilyIdRequired
source: Family ID is required
de: Familien-ID ist erforderlich

# CreatorIdRequired
source: Creator ID is required
de: Ersteller-ID ist erforderlich

source: End time must be after start time
de: Endzeit muss nach der Startzeit liegen

# ChainNameRequired
source: Chain name is required
de: Kettenname ist erforderlich

# ChainNameMaxLength
source: Chain name cannot exceed 200 characters
de: Kettenname darf 200 Zeichen nicht überschreiten

# TriggerEventTypeRequired
source: Trigger event type is required
de: Auslöser-Ereignistyp ist erforderlich

# AtLeastOneStepRequired
source: At least one step is required
de: Mindestens ein Schritt ist erforderlich

# StepAliasRequired
source: Step alias is required
de: Schritt-Alias ist erforderlich

# StepAliasMaxLength
source: Step alias cannot exceed 50 characters
de: Schritt-Alias darf 50 Zeichen nicht überschreiten

# StepNameRequired
source: Step name is required
de: Schrittname ist erforderlich

# ActionTypeRequired
source: Action type is required
de: Aktionstyp ist erforderlich

source: Step order must be positive
de: Schrittreihenfolge muss positiv sein

# FamilyNameRequired
source: Family name is required
de: Familienname ist erforderlich

# OwnerIdRequired
source: Owner ID is required
de: Eigentümer-ID ist erforderlich

# InvitationTokenRequired
source: Invitation token is required
de: Einladungs-Token ist erforderlich

# AcceptingUserIdRequired
source: Accepting user ID is required
de: ID des annehmenden Benutzers ist erforderlich

# InvitationIdRequired
source: Invitation ID is required
de: Einladungs-ID ist erforderlich

# DecliningUserIdRequired
source: Declining user ID is required
de: ID des ablehnenden Benutzers ist erforderlich

# RevokingUserIdRequired
source: Revoking user ID is required
de: ID des widerrufenden Benutzers ist erforderlich

# InviteeEmailRequired
source: Invitee email is required
de: E-Mail des Eingeladenen ist erforderlich

# InviteeEmailInvalidFormat
source: Invalid email format
de: Ungültiges E-Mail-Format

# InvitationRoleInvalid
source: Invitation role must be 'Admin' or 'Member' (Owner role cannot be assigned via invitation)
de: Einladungsrolle muss 'Admin' oder 'Member' sein (Eigentümerrolle kann nicht per Einladung vergeben werden)
